---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentEntryPoint..::..Save Method
DocumentEntryPoint Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Save()()()() | Saves the document.  (Inherited from Document.) |
|  | Save(SaveOptions) | Saves the document.  (Inherited from Document.) |

# See Also

DocumentEntryPoint Class

DocumentEntryPoint Members

Autodesk.Revit.DB.Macros Namespace